In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [2]:
from config import password
a = f'postgresql://postgres:{password}@localhost:5432/sql_challenge'

In [3]:
engine = create_engine(a)
connection = engine.connect()

In [4]:
emp_df = pd.read_sql('Select * FROM employees',connection)

In [5]:
emp_df.head()

   emp_no emp_title_id  birth_date  first_name last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki  Zallocco   M  1990-04-28
1   57444        e0002  1958-01-30       Berry      Babb   F  1992-03-21
2  421786        s0001  1957-09-28       Xiong  Verhoeff   M  1987-11-26
3  282238        e0003  1952-10-28  Abdelkader   Baumann   F  1991-01-18
4  263976        e0003  1959-10-30        Eran  Cusworth   M  1986-11-14

In [6]:
# Create a histogram to visualize the most common salary ranges for employees.

In [7]:
salaries = pd.read_sql('Select * FROM salaries',connection)

In [8]:
salaries

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [9]:
bins = [40000, 55000, 70000, 85000, 100000, 115000, 130000]
group_names = ["D","C", "B", "A", "AA", "AAA"]
salaries["Range"] = pd.cut(salaries["salary"], bins, labels=group_names, include_lowest=True)
salaries

        emp_no  salary Range
0        10001   60117     C
1        10002   65828     C
2        10003   40006     D
3        10004   40054     D
4        10005   78228     B
...        ...     ...   ...
300019  499995   40000     D
300020  499996   58058     C
300021  499997   49597     D
300022  499998   40000     D
300023  499999   63707     C

[300024 rows x 3 columns]

In [ ]:
# GROUPBY.count() and plot

salaries.groupby()